//TODO WHAT A MESS

export function toBasicLatin(input: string): string {
    return input;
}

export default toBasicLatin;

// import { Dictionary, reduce, each, compact, map }    from 'lodash';
// import build                                        from './build';
// import splitChars                                    from './splitChars';

// {"0":"0⁰₀⓪⓿０𝟎𝟘𝟢𝟬𝟶🄋🄌","1":"1¹₁①⓵❶➀➊１𝟏𝟙𝟣𝟭𝟷","2":"2²Ƨƨƻ₂②⓶❷➁➋２𝟐𝟚𝟤𝟮𝟸","3":"3³₃③⓷❸➂➌３𝟑𝟛𝟥𝟯𝟹","4":"4⁴₄④⓸❹➃➍４𝟒𝟜𝟦𝟰𝟺","5":"5Ƽƽ⁵₅⑤⓹❺➄➎５𝟓𝟝𝟧𝟱𝟻","6":"6Ƅƅ⁶₆⑥⓺❻➅➏６𝟔𝟞𝟨𝟲𝟼","7":"7⁷₇⑦⓻❼➆➐７𝟕𝟟𝟩𝟳𝟽","8":"8⁸₈⑧⓼❽➇➑８𝟖𝟠𝟪𝟴𝟾","9":"9⁹₉⑨⓽❾➈➒９𝟗𝟡𝟫𝟵𝟿","10":"⑩⓾❿㉈","11":"⑪⓫","12":"⑫⓬","13":"⑬⓭","14":"⑭⓮","15":"⑮⓯","16":"⑯⓰","17":"⑰⓱","18":"⑱⓲","19":"⑲⓳","20":"⑳⓴㉉","21":"㉑","22":"㉒","23":"㉓","24":"㉔","25":"㉕","26":"㉖","27":"㉗","28":"㉘","29":"㉙","30":"㉊㉚","31":"㉛","32":"㉜","33":"㉝","34":"㉞","35":"㉟","36":"㊱","37":"㊲","38":"㊳","39":"㊴","40":"㉋㊵","41":"㊶","42":"㊷","43":"㊸","44":"㊹","45":"㊺","46":"㊻","47":"㊼","48":"㊽","49":"㊾","50":"㉌㊿","60":"㉍","70":"㉎","80":"㉏","\u0000":"\u0000","\u0001":"\u0001","\u0002":"\u0002","\u0003":"\u0003","\u0004":"\u0004","\u0005":"\u0005","\u0006":"\u0006","\u0007":"\u0007","\b":"\b","\t":"\t","\n":"\n","\u000b":"\u000b","\f":"\f","\r":"\r","\u000e":"\u000e","\u000f":"\u000f","\u0010":"\u0010","\u0011":"\u0011","\u0012":"\u0012","\u0013":"\u0013","\u0014":"\u0014","\u0015":"\u0015","\u0016":"\u0016","\u0017":"\u0017","\u0018":"\u0018","\u0019":"\u0019","\u001a":"\u001a","\u001b":"\u001b","\u001c":"\u001c","\u001d":"\u001d","\u001e":"\u001e","\u001f":"\u001f"," ":" ","!":"!ǀǁǂǃʕʘʬʭᴤꞏ！","\"":"\"＂","#":"#＃","$":"$＄","%":"%％","&":"&＆","'":"'ƾɁɂʔʖʡʢ＇","(":"(（",")":")）","*":"*＊","+":"+＋",",":",，","-":"-－",".":".．","/":"/／",":":":：",";":";；","<":"<＜","=":"=＝",">":">＞","?":"?？","@":"@＠","A":"AÀÁÂÃÄÅĀĂĄǍǞǠǺȀȂȦȺᴀḀẠẢẤẦẨẪẬẮẰẲẴẶⒶⱯＡ🄰🅐🅰󠁁","B":"BƁƂɃʙᴃḂḄḆⒷꞖＢ🄱🅑🅱󠁂","C":"CÇĆĈĊČƇȻᴄḈⒸꜾꞒＣ🄫🄲🅒🅲󠁃","D":"DĎĐƉƊƋᴅḊḌḎḐḒⒹꝹＤ🄳🅓🅳󠁄","E":"EÈÉÊËĒĔĖĘĚƎƐȄȆȨɆᴇḔḖḘḚḜẸẺẼẾỀỂỄỆⒺⱻꞫＥ🄴🅔🅴󠁅","F":"FƑḞⒻꜰꝻꞘＦ🄵🅕🅵󠁆","G":"GĜĞĠĢƓǤǦǴɢʛᷛḠⒼꝽꝾꞠꞬＧ🄶🅖🅶󠁇","H":"HĤĦȞʜḢḤḦḨḪⒽⱧⱵꞍꞪＨ🄷🅗🅷󠁈","I":"IÌÍÎÏĨĪĬĮİƗǏȈȊɪᵻḬḮỈỊⒾꞮＩ🄸🅘🅸󠁉","J":"JĴɈᴊⒿＪ🄹🅙🅹󠁊","K":"KĶƘǨᴋḰḲḴⓀⱩꝀꝂꝄꞢꞰＫ🄺🅚🅺󠁋","L":"LĹĻĽĿŁȽʟᴌᷞḶḸḺḼⓁⱠⱢꝆꝈꞀꞭＬ🄻🅛🅻󠁌","M":"MƜᴍᷟḾṀṂⓂⱮꟺＭ🄼🅜🅼󠁍","N":"NÑŃŅŇƝǸȠɴᴎᷡṄṆṈṊⓃꞐꞤＮ🄽🅝🅽󠁎","O":"OÒÓÔÕÖØŌŎŐƆƟƠǑǪǬǾȌȎȪȬȮȰᴏᴐṌṎṐṒỌỎỐỒỔỖỘỚỜỞỠỢⓄꝊꝌＯ🄾🅞🅾󠁏","P":"PƤᴘṔṖⓅⱣꝐꝒꝔＰ🄿🅟🅿󠁐","Q":"QɊⓆꝖꝘꞯＱ🅀🅠🆀󠁑","R":"RŔŖŘȐȒɌʀʁᴙᴚᷢṘṚṜṞⓇⱤꝚꞂꞦꭆＲ🄬🅁🅡🆁󠁒","S":"SŚŜŞŠȘṠṢṤṦṨẞⓈⱾꜱꞄꞨＳ🄪🅂🅢🆂󠁓","T":"TŢŤŦƬƮȚȾᴛṪṬṮṰⓉꞆꞱＴ🅃🅣🆃󠁔","U":"UÙÚÛÜŨŪŬŮŰŲƯǓǕǗǙǛȔȖɄᴜᵾṲṴṶṸṺỤỦỨỪỬỮỰⓊꞸＵ🅄🅤🆄󠁕","V":"VƲɅᴠṼṾỼⓋꝞＶ🅅🅥🆅󠁖","W":"WŴᴡẀẂẄẆẈⓌⱲＷ🅆🅦🆆󠁗","X":"XẊẌⓍＸ🅇🅧🆇󠁘","Y":"YÝŶŸƳȲɎʏẎỲỴỶỸỾⓎＹ🅈🅨🆈󠁙","Z":"ZŹŻŽƵȤᴢẐẒẔⓏⱫⱿꝢＺ🅉🅩🆉󠁚","[":"[［","\\":"\\＼","]":"]］","^":"^＾","_":"_＿","`":"`｀","a":"aàáâãäåāăąǎǟǡǻȁȃȧɐͣᶏᷓᷲḁẚạảấầẩẫậắằẳẵặₐⓐⱥａ󠁡","b":"bƀƃɓᵬᶀᷨḃḅḇⓑꞗｂ󠁢","c":"cçćĉċčƈȼɕʗͨᷗḉↄⓒꜿꞓꞔｃ󠁣","d":"dďđƌȡɖɗͩᵭᶁᶑᷘḋḍḏḑḓⓓꝺｄ🆥󠁤","e":"eèéêëēĕėęěǝȅȇȩɇɘɛɜɝɞʚͤᴈᶒᶓᶔḕḗḙḛḝẹẻẽếềểễệₑⓔⱸꬲꬳꬴꭡｅ󠁥","f":"fƒᵮᶂᷫḟⓕꝼꞙꟻꬵｆ󠁦","g":"gĝğġģǥǧǵɠɡᵷᵹᶃᷚḡⓖꝿꞡｇ󠁧","h":"hĥħȟɥɦɧʮʯͪḣḥḧḩḫẖₕⓗⱨⱶꜧꞕｈ󠁨","i":"iìíîïĩīĭįıǐȉȋɨͥᴉᵢᶖḭḯỉịⁱⓘꟷꟾｉ󠁩","j":"jĵǰȷɉɟʄⓙⱼｊ󠁪","k":"kķƙǩʞᶄᷜḱḳḵₖⓚⱪꝁꝃꝅꞣｋ󠁫","l":"lĺļľŀłƚȴɫɬɭᶅᷝᷬḷḹḻḽₗⓛⱡꝇꝉꞁꞎꬸꬹｌ󠁬","m":"mɯɰɱͫᴟᵯᶆḿṁṃₘⓜꟽꟿｍ󠁭","n":"nñńņňŉƞǹȵɲɳᵰᶇᷠṅṇṉṋⁿₙⓝꞑꞥｎ󠁮","o":"oòóôõöøōŏőơǒǫǭǿȍȏȫȭȯȱɔɵͦᴑᴒᴓᴖᴗᶗᷭᷳṍṏṑṓọỏốồổỗộớờởỡợₒⓞⱺꝋꝍꬽꬾꬿｏ󠁯","p":"pƥᵱᵽᶈᷮṕṗₚⓟꝑꝓꝕꟼｐ󠁰","q":"qɋʠⓠꝗꝙｑ󠁱","r":"rŕŗřȑȓɍɹɺɻɼɽɾɿͬᵣᵲᵳᶉ᷊ᷣṙṛṝṟⓡⱹꝛꞃꞧꭅꭇꭈꭋꭌｒ󠁲","s":"sßśŝşšſșȿʂᵴᶊᷤᷥṡṣṥṧṩẛẜẝₛⓢꞅꞩｓ󠁳","t":"tţťŧƫƭțȶʇʈͭᵵṫṭṯṱẗₜⓣⱦꞇｔ󠁴","u":"uùúûüũūŭůűųưǔǖǘǚǜȕȗʉͧᴝᴞᵤᶙᷰᷴṳṵṷṹṻụủứừửữựⓤꞹꭎꭏꭒｕ󠁵","v":"vʋʌͮᵥᶌṽṿỽⓥⱱⱴꝟｖ󠁶","w":"wŵʍᷱẁẃẅẇẉẘⓦⱳｗ󠁷","x":"xͯᶍẋẍₓⓧꭖꭗꭘꭙｘ󠁸","y":"yýÿŷƴȳɏʎẏẙỳỵỷỹỿⓨꭚｙ󠁹","z":"zźżžƶȥɀʐʑᵶᶎᷦẑẓẕⓩⱬꝣｚ󠁺","{":"{｛","|":"|｜","}":"}｝","~":"~～","":"","1/4":"¼","1/2":"½","3/4":"¾","AE":"ÆǢǼᴁꞚ","ETH":"Ðᴆ","THORN":"ÞꝤꝦ","ae":"æǣǽᴂᷔꞛ","eth":"ðᷙ","thorn":"þꝥꝧ","IJ":"Ĳ","ij":"ĳ","kra":"ĸ","ENG":"Ŋ","eng":"ŋ","OE":"ŒɶꞜ","oe":"œᴔꞝꭀꭁꭂꭢ","delta":"ƍẟ","SCHWA":"Ə","GAMMA":"Ɣ","hv":"ƕ","IOTA":"Ɩ","lambda":"ƛ","OI":"Ƣ","oi":"ƣ","yr":"Ʀ","ESH":"Ʃƪ","UPSILON":"Ʊ","EZH":"ƷƸǮᴣ","ezh":"ƹƺǯʒʓᶚ","wynn":"ƿ","DZ":"ǄǱ","Dz":"ǅǲ","dz":"ǆǳʣʥ","LJ":"Ǉ","Lj":"ǈ","lj":"ǉ","NJ":"Ǌ","Nj":"ǋ","nj":"ǌ","HWAIR":"Ƕ","WYNN":"Ƿ","YOGH":"Ȝ","yogh":"ȝ","OU":"Ȣᴕ","ou":"ȣ","db":"ȸ","qp":"ȹ","alpha":"ɑɒᶐᷧꬰꭤ","schwa":"əɚᶕᷪₔ","gamma":"ɣ","ramshorn":"ɤ","iota":"ɩᵼ","lezh":"ɮ","omega":"ɷꞷ","phi":"ɸⱷ","esh":"ʃʅʆᶋᶘᷯꭍ","upsilon":"ʊᵿ","dezh":"ʤ","ts":"ʦ","tesh":"ʧ","tc":"ʨ","feng":"ʩ","ls":"ʪꬷ","lz":"ʫ","ain":"ᴥꜥ","ue":"ᵫꞟ","th":"ᵺ","ao":"ᷕꜵ","av":"ᷖꜹꜻ","beta":"ᷩꞵ","LL":"Ỻ","ll":"ỻ","1/7":"⅐","1/9":"⅑","1/10":"⅒","1/3":"⅓","2/3":"⅔","1/5":"⅕","2/5":"⅖","3/5":"⅗","4/5":"⅘","1/6":"⅙","5/6":"⅚","1/8":"⅛","3/8":"⅜","5/8":"⅝","7/8":"⅞","1/":"⅟","@0/3":"↉","(1)":"⑴","(2)":"⑵","(3)":"⑶","(4)":"⑷","(5)":"⑸","(6)":"⑹","(7)":"⑺","(8)":"⑻","(9)":"⑼","(10)":"⑽","(11)":"⑾","(12)":"⑿","(13)":"⒀","(14)":"⒁","(15)":"⒂","(16)":"⒃","(17)":"⒄","(18)":"⒅","(19)":"⒆","(20)":"⒇","1.":"⒈","2.":"⒉","3.":"⒊","4.":"⒋","5.":"⒌","6.":"⒍","7.":"⒎","8.":"⒏","9.":"⒐","10.":"⒑","11.":"⒒","12.":"⒓","13.":"⒔","14.":"⒕","15.":"⒖","16.":"⒗","17.":"⒘","18.":"⒙","19.":"⒚","20.":"⒛","(a)":"⒜","(b)":"⒝","(c)":"⒞","(d)":"⒟","(e)":"⒠","(f)":"⒡","(g)":"⒢","(h)":"⒣","(i)":"⒤","(j)":"⒥","(k)":"⒦","(l)":"⒧","(m)":"⒨","(n)":"⒩","(o)":"⒪","(p)":"⒫","(q)":"⒬","(r)":"⒭","(s)":"⒮","(t)":"⒯","(u)":"⒰","(v)":"⒱","(w)":"⒲","(x)":"⒳","(y)":"⒴","(z)":"⒵","MYSLITE":"Ⱞ","myslite":"ⱞ","ALPHA":"ⱭⱰ","ALEF":"Ꜣ","alef":"ꜣ","AIN":"Ꜥ","HENG":"Ꜧ","TZ":"Ꜩ","tz":"ꜩ","TRESILLO":"Ꜫ","tresillo":"ꜫ","CUARTRILLO":"ꜬꜮ","cuartillo":"ꜭꜯ","AA":"Ꜳ","aa":"ꜳ","AO":"Ꜵ","AU":"Ꜷ","au":"ꜷ","AV":"ꜸꜺ","AY":"Ꜽ","ay":"ꜽ","OO":"Ꝏ","oo":"ꝏꭃꭄ","RUM":"Ꝝꝶ","rum":"ꝝꝵ","VY":"Ꝡ","vy":"ꝡ","VEND":"Ꝩ","vend":"ꝩ","ET":"Ꝫ","ei":"ꝫ","IS":"Ꝭ","is":"ꝭ","CON":"Ꝯ","con":"ꝯ","dum":"ꝱ","lum":"ꝲ","mum":"ꝳ","num":"ꝴ","tum":"ꝷ","um":"ꝸ","SALTILLO":"Ꞌ","saltillo":"ꞌ","UE":"Ꞟ","CHI":"Ꭓ","BETA":"Ꞵ","OMEGA":"Ꞷ","aschwa":"ꬱ","ui":"ꭐꭑ","chi":"ꭓꭔꭕ","sakhayat":"ꭠ","uo":"ꭣ","ff":"ﬀ","fi":"ﬁ","fl":"ﬂ","ffi":"ﬃ","ffl":"ﬄ","st":"ﬅﬆ","0.":"🄀","0,":"🄁","1,":"🄂","2,":"🄃","3,":"🄄","4,":"🄅","5,":"🄆","6,":"🄇","7,":"🄈","8,":"🄉","9,":"🄊","(A)":"🄐","(B)":"🄑","(C)":"🄒","(D)":"🄓","(E)":"🄔","(F)":"🄕","(G)":"🄖","(H)":"🄗","(I)":"🄘","(J)":"🄙","(K)":"🄚","(L)":"🄛","(M)":"🄜","(N)":"🄝","(O)":"🄞","(P)":"🄟","(Q)":"🄠","(R)":"🄡","(S)":"🄢","(T)":"🄣","(U)":"🄤","(V)":"🄥","(W)":"🄦","(X)":"🄧","(Y)":"🄨","(Z)":"🄩"}


// let        basicLatin: Dictionary<string>;

// /**
//   * Change a string to be all from the basic latin unicode plane
//   * @param input        The string
//   */
// export function toBasicLatin
//     (    input: string,
//     ):    string
// {
//     if(!basicLatin)
//     {
//         basicLatin =
//             reduce
//             (    require('./toBasicLatin-data.json') as Record<string, string>,
//                 (a, v, k) => { each(splitChars(v), l => a[l] = k); return a; },
//                 {} as Dictionary<string>
//             );
//     }

//     return build(compact(map(splitChars(input), c => basicLatin[c])));
// }

// export default toBasicLatin;
